# 벨트가 한 칸 회전하면 1번부터 2N-1번까지의 칸은 다음 번호의 칸이 있는 위치로 이동하고,
# 2N번 칸은 1번 칸의 위치로 이동한다. i번 칸의 내구도는 Ai이다.
# 위의 그림에서 1번 칸이 있는 위치를 "올라가는 위치", N번 칸이 있는 위치를 "내려가는 위치"
# 컨베이어 벨트를 이용해 로봇들을 건너편으로 옮기려고 한다.
# 로봇을 옮기는 과정에서는 아래와 같은 일이 순서대로 일어난다.
#
# 1. 벨트가 한 칸 회전한다.
# 2. 가장 먼저 벨트에 올라간 로봇부터, 벨트가 회전하는 방향으로 한 칸 이동할 수 있다면 이동한다.
#    만약 이동할 수 없다면 가만히 있는다.
#   로봇이 이동하기 위해서는 이동하려는 칸에 로봇이 없으며, 그 칸의 내구도가 1 이상 이어야 한다.
# 3. 올라가는 위치에 로봇이 없다면 로봇을 하나 올린다.
# 4. 내구도가 0인 칸의 개수가 K개 이상이라면 과정을 종료한다. 그렇지 않다면 1번으로 돌아간다.

# 종료되었을 때 몇 번째 단계가 진행 중이었는지 구해보자. 가장 처음 수행되는 단계는 1번째 단계
# 몇 번째 단계가 진행 중일때 종료되었는지 출력한다.
N, K = map(int, input().split())
a_lst = list(map(int, input().split()))
